src/cf/Логистика/src/InformationRegisters/СтатусыСкладскихДокументов/СтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыСкладскихДокументов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСкладскихДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Перемещение</types>
      <types>DocumentRef.Списание</types>
      <types>DocumentRef.Оприходование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/Логистика/src/Enums/СтатусыСкладскихДокументов/СтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСкладскихДокументов</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

src/cf/Логистика/src/Documents/ПриходныйОрдер/ПриходныйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйОрдер</name>
  <basedOn>Document.Оприходование</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКПоступлениюНаСклад</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Перемещение</types>
      <types>DocumentRef.Оприходование</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/Логистика/src/Documents/РасходныйОрдер/РасходныйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйОрдер</name>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.Списание</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКРасходуСоСклада</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Перемещение</types>
      <types>DocumentRef.Списание</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/Логистика/src/InformationRegisters/СтатусыСкладскихДокументов/ManagerModule.bsl
Процедура ОпределитьСтатусДокумента(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос.КоличествоДокументов) КАК КоличествоДокументов,
	|	СУММА(ВложенныйЗапрос.КоличествоВыполненныхДокументов) КАК КоличествоВыполненныхДокументов
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 КАК КоличествоДокументов,
	|		ВЫБОР
	|			КОГДА ПриходныйОрдер.Выполнен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоВыполненныхДокументов
	|	ИЗ
	|		Документ.ПриходныйОрдер КАК ПриходныйОрдер
	|	ГДЕ
	|		ПриходныйОрдер.ДокументОснование = &ДокументОснование
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		1,
	|		ВЫБОР
	|			КОГДА РасходныйОрдер.Выполнен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		Документ.РасходныйОрдер КАК РасходныйОрдер
	|	ГДЕ
	|		РасходныйОрдер.ДокументОснование = &ДокументОснование) КАК ВложенныйЗапрос";
	Запрос.УстановитьПараметр("ДокументОснование", Документ);
	Результат = Запрос.Выполнить();
	РасчетныйСтатус = Перечисления.СтатусыСкладскихДокументов.ПустаяСсылка();
	Если Результат.Пустой() Тогда
		РасчетныйСтатус = Перечисления.СтатусыСкладскихДокументов.Новый; 
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если Выборка.КоличествоДокументов = Выборка.КоличествоВыполненныхДокументов Тогда
			РасчетныйСтатус = Перечисления.СтатусыСкладскихДокументов.Завершен;
		Иначе
			РасчетныйСтатус = Перечисления.СтатусыСкладскихДокументов.Подготовлен;
		КонецЕсли;
		
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.СтатусыСкладскихДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() ИЛИ НЕ МенеджерЗаписи.Статус = РасчетныйСтатус Тогда
		МенеджерЗаписи = РегистрыСведений.СтатусыСкладскихДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Документ = Документ;
		МенеджерЗаписи.Статус = РасчетныйСтатус;
		МенеджерЗаписи.Записать();		
	КонецЕсли;	
КонецПроцедуры
